# ADS2288 - October 4th
> Pandas
---

This lesson, we will be focusing our time on a fundamental Python library called `pandas`.  Pandas is used for data manipulation and analysis.  We will cover the concept of **data frames**, reading in a `.csv` file into our Python program, and some basic analysis that we can do on a data set.  Note that there is a lot to `pandas`, just like other libraries, and we are only scratching the surface of all its capabilities.  For more documentation on `pandas`, go to https://pandas.pydata.org/docs/user_guide/index.html.

Pandas is an open-source Python library that provides easy-to-use data structures and data analysis tools. It's widely used in data science and data analysis projects because of its flexibility and powerful capabilities.

Pandas simplifies data manipulation, analysis, and visualization. It allows us to work with structured data efficiently, making it an essential tool for data professionals and analysts.

In [1]:
# let's begin by importing pandas under its standard alias
import pandas as pd

## Data Frames
> A type that is encoded in Pandas
---

A **DataFrame** is a two-dimensional, labeled data structure resembling a **spreadsheet** or SQL table. It consists of rows and columns, where each column can contain different types of data (e.g., numbers, text, dates).

We can utilize DataFrames by either (i) creating our own or (ii) using a previously saved data set and call it into Python to use.  The latter being the more common practice - as its easy to create a data set in *Excel*, for instance.

In [4]:
# To create a DataFrame in Python using Pandas

# Create a list of lists, where we have two quantities
data = [ ['Alice', 25], ['Bob', 30], ['Charlie', 22] ]

# Create headings for the columns of our list of lists
labels = ["Name", "Age"]

# Create a dataframe using our data and columns
df = pd.DataFrame(data, columns = labels)

print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22

We can access and modify specific columns of our DataFrame and even modify them if we wish.

In [7]:
# Accessing a column
ages = df['Age'] #Python is CASE SENSITIVE!
print(ages)

# Modifying a column
df['Age'] += 1
print(df)

0    26
1    31
2    23
Name: Age, dtype: int64
      Name  Age
0    Alice   27
1      Bob   32
2  Charlie   24

### Basic Data Exploration of DataFrames
> Basic methods to play around with to get more information
---

`pandas` and DataFrames have a *ton* of methods that are accessible to us that allow us to get some basic ideas about the data presented.  The DataFrame we just built is fairly simple, but imagine (and we'll see later on) larger data sets that we may need to get some idea regarding.

Here are a few basic data exploration methods that we can use:

In [11]:
# df.shape
df.shape #shows our data set: 3 rows, 2 columns

(3, 2)

In [10]:
# df.head()
df.head()

#it will display the first few rows of data

      Name  Age
0    Alice   27
1      Bob   32
2  Charlie   24

In [12]:
# df.info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [13]:
# df.describe()
df.describe()

             Age
count   3.000000
mean   27.666667
std     4.041452
min    24.000000
25%    25.500000
50%    27.000000
75%    29.500000
max    32.000000

## Reading a CSV File into Python
> Importing a saved data set into Python to use with Pandas
---

In general terms, we often store data sets outside of a Python environment - usually as a spreadsheet in *Excel* or *Google Docs*.  Unfortunately, this means that we cannot use any of the niceties that Python provides in `pandas`.  We can, however, import the data set (when stored as a `.csv` file) into Python.

We first need to ensure that the data set we wish to bring into Python has been saved in the same directory (folder) as our current program.  If you are using Jupyter Notebooks, this means you need to upload the data set into the same folder where your program is saved. 

Go to OWL now and download the data set `sales_data.csv`, then upload this file into the same folder that your currently working in.  **NOTE** if you save this data set in a different folder, you will get an error.

In [14]:
# reading in a .csv file into Python
sales_df = pd.read_csv('sales_data.csv')
print(type(sales_df))

<class 'pandas.core.frame.DataFrame'>

---
### Exercise
Do some basic data exploration of this data using `.head()` and `.info()`.  What can you tell the class about this data set?

---

In [19]:
# basic data exploration
sales_df.head()

         Date    Product   Sales  Revenue     Month
0  2023-01-01  Product A  1200.0    240.0   January
1  2023-01-02  Product B   800.0    160.0   January
2  2023-02-01  Product A  1500.0    300.0  February
3  2023-02-02  Product B   900.0    180.0  February
4  2023-03-01  Product A  1300.0    260.0     March

## Basic Data Analysis with Pandas
> More DataFrame methods to compute basic analysis of data sets

---

There are a vast amount of data analysis tools that we can use in `pandas` on our DataFrames.  We will only go over a select few to showcase various methods.

In [23]:
# Identify the rows with high sales (> $1000)
top_sales = sales_df[sales_df['Sales'] > 1000]
print(top_sales)
# Identify the rows with low sales (< $1000)
low_sales = sales_df[sales_df['Sales'] < 1000]
print(low_sales)

          Date    Product   Sales  Revenue     Month
0   2023-01-01  Product A  1200.0    240.0   January
2   2023-02-01  Product A  1500.0    300.0  February
4   2023-03-01  Product A  1300.0    260.0     March
8   2023-05-01  Product A  1800.0    420.0       May
11  2023-06-02  Product B  1200.0    310.0      June
12  2023-07-01  Product A  1550.0    320.0      July
14  2023-08-01  Product A  1350.0    260.0    August
          Date    Product  Sales  Revenue     Month
1   2023-01-02  Product B  800.0    160.0   January
3   2023-02-02  Product B  900.0    180.0  February
5   2023-03-02  Product B  950.0    190.0     March
7   2023-04-02  Product B  850.0    190.0     April
9   2023-05-02  Product B  750.0    100.0       May
10  2023-06-01  Product A  500.0     50.0      June
13  2023-07-02  Product B  800.0    160.0      July
15  2023-08-02  Product B  875.0    210.0    August

In [29]:
### The .groupby() method - allows us to aggregrate our data and collect more information

# aggregrate monthly sales and revenue data
monthly_sales = sales_df.groupby('Month').sum()
print(monthly_sales)

# aggregrate monthly sales data only
monthly_sales = sales_df.groupby('Month')['Sales'].sum()
print(monthly_sales)

           Sales  Revenue
Month
April     1850.0    400.0
August    2225.0    470.0
February  2400.0    480.0
January   2000.0    400.0
July      2350.0    480.0
June      1700.0    360.0
March     2250.0    450.0
May       2550.0    520.0
Month
April       1850.0
August      2225.0
February    2400.0
January     2000.0
July        2350.0
June        1700.0
March       2250.0
May         2550.0
Name: Sales, dtype: float64

/var/folders/cz/b459nk9s47n9_9ykqvrh5tzh0000gn/T/ipykernel_88553/1961195155.py:4: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  monthly_sales = sales_df.groupby('Month').sum()

In [34]:
# what does this code do? Change False to True ... what happens?

top_products = sales_df.groupby('Product')['Sales'].sum().sort_values(ascending=True)

#sort sales in ascending order (when True) for product A followed by B

print(top_products)

Product
Product B     7125.0
Product A    10200.0
Name: Sales, dtype: float64

### Some Sports Analytics - Basics with Pandas
---

Download the data set called `baseball23_data.csv` and load into Python as a DataFrame.  Explore this data set using `.head()`, `.info()` and `.describe()`.

In [40]:
# Examine the baseball23_data dataset
baseball_df = pd.read_csv('baseball23_data.csv')

baseball_df.head()
#baseball_df.info()
#baseball_df.describe()

,Tm,#Bat,BatAge,R/G,G,PA,AB,R,H,2B,...,SLG,OPS,OPS+,TB,GDP,HBP,SH,SF,IBB,LOB
0,Arizona Diamondbacks,54,27.4,4.60,162,6124,5436,746,1359,274,...,0.408,0.730,98,2219,121,58,36,50,11,1091
1,Atlanta Braves,53,27.9,5.85,162,6249,5597,947,1543,293,...,0.501,0.845,124,2803,128,67,2,43,20,1062
2,Baltimore Orioles,50,27.3,4.98,162,6123,5495,807,1399,309,...,0.421,0.742,107,2313,114,45,21,47,14,1041
3,Boston Red Sox,56,28.6,4.77,162,6174,5562,772,1437,339,...,0.424,0.748,100,2360,118,71,11,35,15,1117
4,Chicago Cubs,48,28.4,5.06,162,6220,5504,819,1399,269,...,0.421,0.751,100,2316,95,77,15,52,11,1127

In [52]:
# Let's sort the data set by number of runs scored, and make sure to only print the Teams and
# their associated runs scored ... any guesses?

runs_scored = baseball_df.groupby('Tm')['R'].sum().sort_values(ascending = False)
print(runs_scored)

print(baseball_df.sort_values(by = ['R'], ascending = False)[['Tm', 'R']])

Tm
Atlanta Braves           947
Los Angeles Dodgers      906
Texas Rangers            881
Tampa Bay Rays           860
Houston Astros           827
Chicago Cubs             819
Baltimore Orioles        807
Philadelphia Phillies    796
Cincinnati Reds          783
Minnesota Twins          778
Boston Red Sox           772
Seattle Mariners         758
San Diego Padres         752
Arizona Diamondbacks     746
Toronto Blue Jays        746
Los Angeles Angels       739
Milwaukee Brewers        728
Colorado Rockies         721
St. Louis Cardinals      719
New York Mets            717
Washington Nationals     700
Pittsburgh Pirates       692
Kansas City Royals       676
San Francisco Giants     674
New York Yankees         673
Miami Marlins            668
Cleveland Guardians      662
Detroit Tigers           661
Chicago White Sox        641
Oakland Athletics        585
Name: R, dtype: int64
                       Tm    R
1          Atlanta Braves  947
13    Los Angeles Dodgers  906
27          Texas Rangers  881
26         Tampa Bay Rays  860
10         Houston Astros  827
4            Chicago Cubs  819
2       Baltimore Orioles  807
20  Philadelphia Phillies  796
6         Cincinnati Reds  783
16        Minnesota Twins  778
3          Boston Red Sox  772
23       Seattle Mariners  758
22       San Diego Padres  752
0    Arizona Diamondbacks  746
28      Toronto Blue Jays  746
12     Los Angeles Angels  739
15      Milwaukee Brewers  728
8        Colorado Rockies  721
25    St. Louis Cardinals  719
17          New York Mets  717
29   Washington Nationals  700
21     Pittsburgh Pirates  692
11     Kansas City Royals  676
24   San Francisco Giants  674
18       New York Yankees  673
14          Miami Marlins  668
7     Cleveland Guardians  662
9          Detroit Tigers  661
5       Chicago White Sox  641
19      Oakland Athletics  585

---
### Exercise

Print out the teams that have greater runs scored than the average runs scored for the league.

---